nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/radiotestsuite_cmds.c
/*
 * Copyright 2021-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "app.h"
#include "board.h"
#include "fsl_power.h"
#include "fsl_system.h"
#include "ble_controller.h"
#include "fsl_iap_ffr.h"
#include "hci.h"
#include "ll_error.h"
#include "hci_transport.h"
#include "hci_custom_cmds.h"
#include "fsl_os_abstraction.h"
#include "fsl_component_led.h"
#include "fsl_component_timer_manager.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/** List of custom HCI commands needed by Radio Test Suite */
typedef enum
{
    HCI_OCF_START_DTM_TX_V2_AND_COUNT = 0x06,
    HCI_OCF_STOP_DTM_TX_V2_AND_COUNT  = 0x07,
    HCI_OCF_SET_APP_MODE              = 0x10,
    HCI_OCF_CHIP_ID_GET               = 0x11,
    HCI_OCF_GET_VERSION               = 0x12,
    HCI_OCF_SET_OUTPUT_POWER          = 0x13,
    HCI_OCF_CW_TRANSMITTER            = 0x14,
    HCI_OCF_SET_PHY_MODE              = 0x15,
    HCI_OCF_PRBS_TRANSMITTER          = 0x16,
    HCI_OCF_CW_RSSI_MEASURE           = 0x17,
    HCI_OCF_CW_RSSI_GET               = 0x18,
    HCI_OCF_START_CW_TEST             = 0x19,
    HCI_OCF_CONFIGURE_XTAL_CAPS       = 0x1A,
    HCI_OCF_SET_CLKOUT                = 0x1C,
} hci_custom_commands_radio_test_tool_t;

/** Radio Test Suite version number */
#define SWMAJOR (2)
#define SWMINOR (1)

/** Size of UUID */
#define UUIDSIZEBYTES (16)

/** The priority of the Radio Test Suite task */
#define RADIO_TEST_SUITE_TASK_PRIO (7)
/** The stack size of the Radio Test Suite task */
#define RADIO_TEST_SUITE_TASK_STACK_SIZE (1248)

/** Events used for signalisation of Radio Test Suite task */
#define EVENT_CW_PROCESS  (0x1)
#define EVENT_EXECUTE_DTM (0x2)
#define EVENT_STOP_DTM    (0x3)

/** Used Ctimer instance for Timer Manager */
#define TM_CTIMER_INSTANCE 0U


/** Application modes of Radio Test Suite */
typedef enum
{
    kAPPMODE_Blackbox = 0,
    APPMODE_CwTest   = 1
} appmode_t;

/** CW teset parameters */
typedef struct
{
    uint16_t delayMs;                    /* Delay between channel hops in ms */
    channel_selection_cw_t channelStart; /* Start channel [0..39] */
    channel_selection_cw_t channelStop;  /* Stop channel [0..39] */
    uint8_t channelIncr;                 /* Channel increment */

    uint8_t active;                         /* Test running or not, set this to >0 to actvate */
    channel_selection_cw_t currentChannel; /* Channel currently being tranmitted on */
    uint16_t currentDelayMs;              /* Hopping timer, initialised to delayMs, hop to next channel when 0 */
    int16_t currentOperateMs;             /* Running time, initialised to timeToOperate*1000, stop when 0 */
} cw_test_params_t;

/** Function called before main is entered */
int RadioTestSuitePreMainInit(void) __attribute__((constructor));

static void StartRadioTestSuiteMode(void);
static void RadioTestSuiteTask(void *argument);
static void HandleStandaloneCwTest(void);
static ble_stat_t SetAppMode(uint8_t nbOfInParams,
                             uint8_t *inParams,
                             uint8_t *evntPcktP,
                             uint8_t *outParamsLength,
                             hci_return_command_type *returnCommandType);
static ble_stat_t GetChipID(uint8_t nbOfInParams,
                            uint8_t *inParams,
                            uint8_t *evntPcktP,
                            uint8_t *outParamsLength,
                            hci_return_command_type *returnCommandType);
static ble_stat_t GetVersion(uint8_t nbOfInParams,
                             uint8_t *inParams,
                             uint8_t *evntPcktP,
                             uint8_t *outParamsLength,
                             hci_return_command_type *returnCommandType);
static ble_stat_t SetOutputPower(uint8_t nbOfInParams,
                                 uint8_t *inParams,
                                 uint8_t *evntPcktP,
                                 uint8_t *outParamsLength,
                                 hci_return_command_type *returnCommandType);
static ble_stat_t CWTransmitter(uint8_t nbOfInParams,
                                uint8_t *inParams,
                                uint8_t *evntPcktP,
                                uint8_t *outParamsLength,
                                hci_return_command_type *returnCommandType);
static ble_stat_t SetPhyMode(uint8_t nbOfInParams,
                             uint8_t *inParams,
                             uint8_t *evntPcktP,
                             uint8_t *outParamsLength,
                             hci_return_command_type *returnCommandType);
static ble_stat_t PrbsTransmitter(uint8_t nbOfInParams,
                                  uint8_t *inParams,
                                  uint8_t *evntPcktP,
                                  uint8_t *outParamsLength,
                                  hci_return_command_type *returnCommandType);
static ble_stat_t RssiMeasure(uint8_t nbOfInParams,
                              uint8_t *inParams,
                              uint8_t *evntPcktP,
                              uint8_t *outParamsLength,
                              hci_return_command_type *returnCommandType);
static ble_stat_t RssiGet(uint8_t nbOfInParams,
                          uint8_t *inParams,
                          uint8_t *evntPcktP,
                          uint8_t *outParamsLength,
                          hci_return_command_type *returnCommandType);
static ble_stat_t StartCwTest(uint8_t nbOfInParams,
                              uint8_t *inParams,
                              uint8_t *evntPcktP,
                              uint8_t *outParamsLength,
                              hci_return_command_type *returnCommandType);
static ble_stat_t ConfigureXtalCaps(uint8_t nbOfInParams,
                                    uint8_t *inParams,
                                    uint8_t *evntPcktP,
                                    uint8_t *outParamsLength,
                                    hci_return_command_type *returnCommandType);
static ble_stat_t StartDTMTxV2AndCount(uint8_t nbOfInParams,
                                       uint8_t *inParams,
                                       uint8_t *evntPcktP,
                                       uint8_t *outParamsLength,
                                       hci_return_command_type *returnCommandType);
static ble_stat_t StopDTMTxV2AndCount(uint8_t nbOfInParams,
                                      uint8_t *inParams,
                                      uint8_t *evntPcktP,
                                      uint8_t *outParamsLength,
                                      hci_return_command_type *returnCommandType);
static ble_stat_t ExecuteDTMTxAndCount(void);
static ble_stat_t SetClkOutFunction(uint8_t nbOfInParams,
                                    uint8_t *inParams,
                                    uint8_t *evntPcktP,
                                    uint8_t *outParamsLength,
                                    hci_return_command_type *returnCommandType);

