nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/radiotestsuite_cmds.c
/*******************************************************************************
 * Variables
 ******************************************************************************/

/** Led handle */
extern led_config_t g_ledMonochrome[LED_TYPE_MONOCHROME_COUNT];
static LED_HANDLE_DEFINE(s_ledMonochromeHandle);

/* LED configurations */
static led_flash_config_t s_ledFlashSlow = {
    .times     = LED_FLASH_CYCLE_FOREVER,
    .period    = 2000,
    .flashType = kLED_FlashOneColor,
    .duty      = 50
};
static led_flash_config_t s_ledFlashFast = {
    .times     = LED_FLASH_CYCLE_FOREVER,
    .period    = 200,
    .flashType = kLED_FlashOneColor,
    .duty      = 50
};

/** Handle of the Radio Test Suite task */
static OSA_TASK_HANDLE_DEFINE(s_RadioTestSuiteTaskHandle);
/** The Radio Test Suite task */
static OSA_TASK_DEFINE(RadioTestSuiteTask, RADIO_TEST_SUITE_TASK_PRIO, 1, RADIO_TEST_SUITE_TASK_STACK_SIZE, 0);
OSA_EVENT_HANDLE_DEFINE(s_EventHandle);

static appmode_t s_appMode                      = kAPPMODE_Blackbox;
static volatile cw_test_params_t s_cwTestParams = {.active = 0, .currentOperateMs = 0, .currentDelayMs = 0};
static volatile uint32_t s_msCounter;
static uint8_t s_txChannel;
static uint8_t s_packetPayload;
static uint8_t s_lengthOfTestData;
static uint8_t s_phy;
static uint32_t s_numberOfPacketsTransmitted = 0;
static uint8_t s_Uuid[UUIDSIZEBYTES];

/* Custom commands related to Radio Test Suite */
static const CustomHciCmd customHCIOperations_RadioTestSuite[] = {
    {.opcode          = GET_OP_CODE(HCI_OCF_START_DTM_TX_V2_AND_COUNT, HCI_OGF_EXT),
     .nbOfInParams = 4,
     .func            = StartDTMTxV2AndCount},
    {.opcode          = GET_OP_CODE(HCI_OCF_STOP_DTM_TX_V2_AND_COUNT, HCI_OGF_EXT),
     .nbOfInParams = 0,
     .func            = StopDTMTxV2AndCount},

    {.opcode = GET_OP_CODE(HCI_OCF_SET_APP_MODE, HCI_OGF_EXT), .nbOfInParams = 1, .func = SetAppMode},
    {.opcode = GET_OP_CODE(HCI_OCF_CHIP_ID_GET, HCI_OGF_EXT), .nbOfInParams = 0, .func = GetChipID},
    {.opcode = GET_OP_CODE(HCI_OCF_GET_VERSION, HCI_OGF_EXT), .nbOfInParams = 0, .func = GetVersion},
    {.opcode = GET_OP_CODE(HCI_OCF_SET_OUTPUT_POWER, HCI_OGF_EXT), .nbOfInParams = 1, .func = SetOutputPower},
    {.opcode = GET_OP_CODE(HCI_OCF_CW_TRANSMITTER, HCI_OGF_EXT), .nbOfInParams = 1, .func = CWTransmitter},
    {.opcode = GET_OP_CODE(HCI_OCF_SET_PHY_MODE, HCI_OGF_EXT), .nbOfInParams = 1, .func = SetPhyMode},
    {.opcode = GET_OP_CODE(HCI_OCF_PRBS_TRANSMITTER, HCI_OGF_EXT), .nbOfInParams = 1, .func = PrbsTransmitter},
    {.opcode = GET_OP_CODE(HCI_OCF_CW_RSSI_MEASURE, HCI_OGF_EXT), .nbOfInParams = 1, .func = RssiMeasure},
    {.opcode = GET_OP_CODE(HCI_OCF_CW_RSSI_GET, HCI_OGF_EXT), .nbOfInParams = 0, .func = RssiGet},
    {.opcode = GET_OP_CODE(HCI_OCF_START_CW_TEST, HCI_OGF_EXT), .nbOfInParams = 8, .func = StartCwTest},
    {.opcode = GET_OP_CODE(HCI_OCF_CONFIGURE_XTAL_CAPS, HCI_OGF_EXT), .nbOfInParams = 2, .func = ConfigureXtalCaps},
    {.opcode = GET_OP_CODE(HCI_OCF_SET_CLKOUT, HCI_OGF_EXT), .nbOfInParams = 1, .func = SetClkOutFunction}};

/*******************************************************************************
 * Static functions
 ******************************************************************************/

/*!
 * @brief Function to start Radio Test Suite Mode once first command is received from Test Tool
 */
static void StartRadioTestSuiteMode(void)
{
    static bool radioTestSuiteStarted = false;

    if(radioTestSuiteStarted == false)
    {
        /* Set systick reload value to generate 1 ms interrupts */
        SysTick_Config(SystemCoreClock / 1000);

        /* Initialize timer manager (needed by LED component)*/
        timer_config_t timerConfig;
        timer_status_t timerStatus;
        led_status_t ledStatus;
        
        CLOCK_AttachClk(kMAIN_CLK_to_CTIMER0);
        timerConfig.instance              = TM_CTIMER_INSTANCE;
        timerConfig.srcClock_Hz           = CLOCK_GetCTimerClkFreq(TM_CTIMER_INSTANCE);
        timerConfig.clockSrcSelect        = 0;
        timerStatus = TM_Init(&timerConfig);
        assert_equal(kStatus_TimerSuccess, timerStatus);
        (void)timerStatus;

        /* Initialize LED */
        ledStatus = LED_Init(s_ledMonochromeHandle, &g_ledMonochrome[0]);
        assert_equal(kStatus_LED_Success, ledStatus);
        (void)ledStatus;

        /* Blink slow to indicate normal operation */
        LED_Flash(s_ledMonochromeHandle, &s_ledFlashSlow);
        radioTestSuiteStarted = true;

        /* Register task for Radio Test Suite*/
        osa_status_t osaStatus =
            OSA_TaskCreate((osa_task_handle_t)s_RadioTestSuiteTaskHandle, OSA_TASK(RadioTestSuiteTask), NULL);
        (void)osaStatus;
        assert_equal(osaStatus, KOSA_StatusSuccess);
        (void)OSA_EventCreate(s_EventHandle, (uint8_t)TRUE);
    }
}

/*!
 * @brief Convert power parameter from Python tool to parameter accepted by the BLE manager.
 * The parameter is not checked for bounds.
 */
static int8_t Power2dBm(uint8_t p)
{
    return p * 2 - 10;
}

/*!
 * @brief Validate channel parameter.
 * The channel number of the Python testsuite matches the number of the BLE manager.
 */
static bool ChannelInRange(uint8_t channel)
{
    return (channel >= kBLEC_CHANNEL_CW_0) && (channel <= kBLEC_CHANNEL_CW_MAX);
}

/*!
 * @brief Validate power parameter (NOT dBm).
 * Valid range for [0..8].
 */
static bool PowerInRange(uint8_t power)
{
    return power <= 8;
}

static void HandleStandaloneCwTest()
{
    /* Are we done yet? */
    if (s_cwTestParams.currentOperateMs == 0) /* Negative = forever, 0 = done, >0 = counting down till done */
    {
        s_cwTestParams.active = 0;
        LED_Flash(s_ledMonochromeHandle, &s_ledFlashSlow);
        BLEController_ContinuousWave_Stop(); /* Continue even with error */

        /* Leave standalone mode */
        s_appMode = kAPPMODE_Blackbox;
        return;
    }

    /* Not done, do we need to hop to other channels? */
    if (s_cwTestParams.currentDelayMs == 0)
    {
        s_cwTestParams.currentDelayMs = s_cwTestParams.delayMs; /* Reload delay timer */

        uint8_t oldChannel = s_cwTestParams.currentChannel;
        s_cwTestParams.currentChannel += s_cwTestParams.channelIncr;    /* Next channel */
        if (s_cwTestParams.currentChannel > s_cwTestParams.channelStop) /* Rewind to start channel? */
        {
            s_cwTestParams.currentChannel = s_cwTestParams.channelStart;
        }
        if (s_cwTestParams.currentChannel != oldChannel)
        {
            BLEController_ContinuousWave_Stop();                                /* Stop current TX */
            BLEController_ContinuousWave_StartTx(s_cwTestParams.currentChannel); /* TX on new channel */
        }
    }
}

static ble_stat_t SetAppMode(uint8_t nbOfInParams,
                             uint8_t *inParams,
                             uint8_t *evntPcktP,
                             uint8_t *outParamsLength,
                             hci_return_command_type *returnCommandType)
{
    ble_stat_t status  = SUCCESS;
    *outParamsLength = 0;

    StartRadioTestSuiteMode();

    /* Extract the mode parameter  from the received pckt_p */
    int mode = inParams[0];

    /* Make sure mode is in the right interval */
    if ((mode >= 0) && (mode <= 1)) /* Constants defined in the Python test suite */
    {
        s_appMode                         = (appmode_t)mode;
        s_cwTestParams.currentOperateMs = 0; /* Unconditionally leave standalone CW test mode */

        *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
        status               = SUCCESS;
    }
    else
    {
        /* mode is out of range */
        status = PARAMETER_OUT_OF_MANDATORY_RANGE;
        /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

