nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/radiotestsuite_cmds.c
    return status;
}

static ble_stat_t GetChipID(uint8_t nbOfInParams,
                            uint8_t *inParams,
                            uint8_t *evntPcktP,
                            uint8_t *outParamsLength,
                            hci_return_command_type *returnCommandType)
{
    memcpy(evntPcktP, s_Uuid, UUIDSIZEBYTES);
    *outParamsLength = UUIDSIZEBYTES;

    *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;

    return SUCCESS;
}

static ble_stat_t GetVersion(uint8_t nbOfInParams,
                             uint8_t *inParams,
                             uint8_t *evntPcktP,
                             uint8_t *outParamsLength,
                             hci_return_command_type *returnCommandType)
{
    evntPcktP[0]     = SWMAJOR;
    evntPcktP[1]     = SWMINOR;
    evntPcktP[2]     = 0; /* Reserved for future use */
    evntPcktP[3]     = 0; /* Reserved for future use */
    evntPcktP[4]     = (uint8_t)SYSTEM_GetChipVersion();
    *outParamsLength = 5;

    /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
    *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;

    return SUCCESS;
}

static ble_stat_t SetOutputPower(uint8_t nbOfInParams,
                                 uint8_t *inParams,
                                 uint8_t *evntPcktP,
                                 uint8_t *outParamsLength,
                                 hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the output power parameter from the received pckt_p */
    uint8_t power = inParams[0];
    /* Make sure power is in the right interval */
    if (PowerInRange(power))
    {
        /* Set power */
        blec_result_t ret = BLEController_SetTxPowerDbm(Power2dBm(power));
        if (ret != kBLEC_Success)
        {
            /* Should not come here */
            status = UNSPECIFIED_ERROR;
            /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
        }
        else
        {
            /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            status               = SUCCESS;
        }
    }
    else
    {
        /* Power is out of range */
        status = PARAMETER_OUT_OF_MANDATORY_RANGE;
        /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

    return status;
}

static ble_stat_t CWTransmitter(uint8_t nbOfInParams,
                                uint8_t *inParams,
                                uint8_t *evntPcktP,
                                uint8_t *outParamsLength,
                                hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the channel parameter from the received pckt_p */
    bool enable                    = (inParams[0] & 0x80) == 0x80;
    channel_selection_cw_t channel = (channel_selection_cw_t)(inParams[0] & 0x7F);

    if (ChannelInRange(channel))
    {
        if (enable)
        {
            if (BLEController_ContinuousWave_StartTx(channel) == kBLEC_Success)
            {
                /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                status               = SUCCESS;
            }
            else
            {
                /* BLE manager problem, should not come here */
                status = UNSPECIFIED_ERROR;
                /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
            }
        }
        else
        {
            if (BLEController_ContinuousWave_Stop() == kBLEC_Success)
            {
                /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                status               = SUCCESS;
            }
            else
            {
                /* BLE manager problem, should not come here */
                status = UNSPECIFIED_ERROR;
                /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
            }
        }
    }
    else
    {
        /* Channel is out of range */
        status = PARAMETER_OUT_OF_MANDATORY_RANGE;
        /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

    return status;
}

static tx_rx_phy_t gPhyMode = kBLEC_PHY_1M;

static ble_stat_t SetPhyMode(uint8_t nbOfInParams,
                             uint8_t *inParams,
                             uint8_t *evntPcktP,
                             uint8_t *outParamsLength,
                             hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the phymode parameter from the received pckt_p */
    switch (inParams[0])
    {
        case 0:
            gPhyMode = kBLEC_PHY_1M;
            /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            status               = SUCCESS;
            break;
        case 1:
            gPhyMode = kBLEC_PHY_2M;
            /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            status               = SUCCESS;
            break;
        case 2:
            gPhyMode = kBLEC_PHY_CODED_S8;
            /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            status               = SUCCESS;
            break;
        case 3:
            gPhyMode = kBLEC_PHY_CODED;
            /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            status               = SUCCESS;
            break;
        default:
            /* Phy mode is out of range */
            status = PARAMETER_OUT_OF_MANDATORY_RANGE;
            /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

