nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/radiotestsuite_cmds.c
    return status;
}

static ble_stat_t PrbsTransmitter(uint8_t nbOfInParams,
                                  uint8_t *inParams,
                                  uint8_t *evntPcktP,
                                  uint8_t *outParamsLength,
                                  hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the channel parameter from the received pckt_p */
    bool enable                    = (inParams[0] & 0x80) == 0x80;
    channel_selection_cw_t channel = (channel_selection_cw_t)(inParams[0] & 0x7F);

    if (ChannelInRange(channel))
    {
        if (enable)
        {
            if (BLEController_ContinuousWave_StartTxModulated(channel, kBLEC_PAYLOAD_TYPE_CW_PRBS9, gPhyMode) ==
                kBLEC_Success)
            {
                /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                status               = SUCCESS;
            }
            else
            {
                /* Should not come here */
                status = UNSPECIFIED_ERROR;
                /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
            }
        }
        else
        {
            if (BLEController_ContinuousWave_Stop() == kBLEC_Success)
            {
                /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                status               = SUCCESS;
            }
            else
            {
                /* Should never come here */
                status = UNSPECIFIED_ERROR;
                /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
            }
        }
    }
    else
    {
        /* Channel is out of range */
        status = PARAMETER_OUT_OF_MANDATORY_RANGE;
        /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

    return status;
}

/*!
 * @brief Start the RSSI measuring function. This function does NOT return the RSSI value
 */
static ble_stat_t RssiMeasure(uint8_t nbOfInParams,
                              uint8_t *inParams,
                              uint8_t *evntPcktP,
                              uint8_t *outParamsLength,
                              hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;
    blec_result_t result;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the channel parameter from the received pckt_p */
    bool enable                    = (inParams[0] & 0x80) == 0x80;
    channel_selection_cw_t channel = (channel_selection_cw_t)(inParams[0] & 0x7F);

    if (ChannelInRange(channel))
    {
        if (enable)
        {
            /* Start RSSI measurement */
            result = BLEController_ContinuousWave_StartRx(channel); /* start receive to measure RSSI on this channel */
            if (result == kBLEC_Success)
            {
                *outParamsLength = 0;
                /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                return SUCCESS;
            }
            else
            {
                /* Something wrong */
                status = UNSPECIFIED_ERROR;
                /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
            }
        }
        else
        {
            /* Stop reception */
            result = BLEController_ContinuousWave_Stop();
            if (result == kBLEC_Success)
            {
                /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                status               = SUCCESS;
            }
            else
            {
                /* Should never come here */
                status = UNSPECIFIED_ERROR;
                /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
                *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
            }
        }
    }
    else
    {
        /* Channel is out of range */
        status = PARAMETER_OUT_OF_MANDATORY_RANGE;
        /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

    return status;
}

/*!
 * @brief Get the RSSI value measured by the RssiMeasure() function
 */
static ble_stat_t RssiGet(uint8_t nbOfInParams,
                          uint8_t *inParams,
                          uint8_t *evntPcktP,
                          uint8_t *outParamsLength,
                          hci_return_command_type *returnCommandType)
{
    int16_t rssi = (BLEController_ContinuousWave_ReadRSSI() - 2) / 4; /* returned steps are in 0.25 dBm */

    *outParamsLength = 2;
    /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
    *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
    evntPcktP[0]       = rssi & 0xff;
    evntPcktP[1]       = (rssi >> 8) & 0xff;
    return SUCCESS;
}

/*!
 * @brief Start a standalone CW transmitter, hopping through different frequencies
 */
static ble_stat_t StartCwTest(uint8_t nbOfInParams,
                              uint8_t *inParams,
                              uint8_t *evntPcktP,
                              uint8_t *outParamsLength,
                              hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    uint16_t timeToOperate = 0;
    uint16_t delayMs        = 0;
    uint8_t power, channelStart, channelStop, channelIncr;

    timeToOperate = inParams[0] + (inParams[1] << 8);
    delayMs        = inParams[2] + (inParams[3] << 8);
    power           = inParams[4];
    channelStart   = inParams[5];
    channelStop    = inParams[6];
    channelIncr    = inParams[7];

    *outParamsLength = 0;

    /* Prepare for the worst: some parameter(s) out of range and return HCI_RETURN_COMMAND_TYPE_STATUS to mention that
     * something went wrong */
    status               = PARAMETER_OUT_OF_MANDATORY_RANGE;
    *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;

    /* Validate arguments and execute */
    if (ChannelInRange(channelStart) && ChannelInRange(channelStop) && ChannelInRange(channelIncr) &&
        PowerInRange(power))
    {
        status = SUCCESS;
        /* Halt SysTick timer and disable interrupt */
        SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk;
        __ISB(); /* not sure if we need this */
        __DSB();

        s_cwTestParams.active = 0;

        /* boundary/reload values */
        s_cwTestParams.delayMs      = delayMs;
        s_cwTestParams.channelStart = channelStart;
        s_cwTestParams.channelStop  = channelStop;
        s_cwTestParams.channelIncr  = channelIncr;

