nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/radiotestsuite_cmds.c
        /* "Current" parameters */
        s_cwTestParams.currentOperateMs =
            timeToOperate == 0 ? -1 : timeToOperate * 1000; /* convert operate time to ms_time */
        s_cwTestParams.currentChannel  = s_cwTestParams.channelStart;
        s_cwTestParams.currentDelayMs = s_cwTestParams.delayMs;

        /* Start BLE */
        status = BLEController_SetTxPowerDbm(Power2dBm(power));
        if (status == SUCCESS)
        {
            status = BLEController_ContinuousWave_Stop();
            if (status == SUCCESS)
            {
                status = BLEController_ContinuousWave_StartTx(s_cwTestParams.currentChannel);
                if (status == SUCCESS)
                {
                    /* start standalone test */
                    s_cwTestParams.active = 1;
                    LED_Flash(s_ledMonochromeHandle, &s_ledFlashFast);

                    /* Enable SysTick IRQ and SysTick Timer */
                    SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_ENABLE_Msk;

                    /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
                    *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
                }
            }
        }
    }
    return status;
}

static ble_stat_t ConfigureXtalCaps(uint8_t nbOfInParams,
                                    uint8_t *inParams,
                                    uint8_t *evntPcktP,
                                    uint8_t *outParamsLength,
                                    hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the cap parameters from the received pckt_p */
    uint8_t capIn  = inParams[0];
    uint8_t capOut = inParams[1];

    if ((capIn <= 15) && (capOut <= 15))
    {
        POWER_XTAL32K_ConfigureCaps(capIn, capOut);
        /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
    }
    else
    {
        /* Cap(s) out of range */
        status = PARAMETER_OUT_OF_MANDATORY_RANGE;
        /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
        *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }

    return status;
}

static ble_stat_t StartDTMTxV2AndCount(uint8_t nbOfInParams,
                                       uint8_t *inParams,
                                       uint8_t *evntPcktP,
                                       uint8_t *outParamsLength,
                                       hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;
    /* Extract the parameters from the received pckt_p */
    s_txChannel          = inParams[0];
    s_lengthOfTestData = inParams[1];
    s_packetPayload      = inParams[2];
    s_phy                 = inParams[3];

    s_numberOfPacketsTransmitted = 0;
    /* Disable s_phy calibration before every DTM command but this command does s_phy calibration once */
    ll_intf_start_phy_clbr(0);

    /* No parameters to return */
    *outParamsLength = 0;
    /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
    *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;

    (void)OSA_EventSet((osa_event_handle_t)s_EventHandle, EVENT_EXECUTE_DTM);

    return status;
}

static ble_stat_t StopDTMTxV2AndCount(uint8_t nbOfInParams,
                                      uint8_t *inParams,
                                      uint8_t *evntPcktP,
                                      uint8_t *outParamsLength,
                                      hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* Parameters to return */
    *outParamsLength = 2;
    /* Return HCI_RETURN_COMMAND_TYPE_COMPLETE  */
    *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
    evntPcktP[0]       = s_numberOfPacketsTransmitted & 0xff;
    evntPcktP[1]       = (s_numberOfPacketsTransmitted >> 8) & 0xff;

    (void)OSA_EventSet((osa_event_handle_t)s_EventHandle, EVENT_STOP_DTM);

    return status;
}

/*
 * @brief workaround for DTM TX not counting packets as defined in BLE core spec.
 * Start a transmitter test and stop it immediately. ll_intf_le_test_end() will wait till the single packet is sent.
 * There is a risk of being interrupted (e.g. systick) between ll_intf_le_enhanced_transmitter_test and
 * ll_intf_le_test_end and if that interruption lasts very long we could have more than one packet transmitted. However
 * a packet lasts in the order of 1 ms, so in practice this is unlikely to happen.
 */
static ble_stat_t ExecuteDTMTxAndCount(void)
{
    ble_stat_t status;
    status = ll_intf_le_enhanced_transmitter_test(s_txChannel, s_lengthOfTestData, s_packetPayload, s_phy);
    if (status == SUCCESS)
    {
        s_numberOfPacketsTransmitted++;
        /* Stop DTM TX.  Function waits till packet is transmitted.  Returned numberOfPackets = 0. */
        uint16_t numberOfPackets;
        status = ll_intf_le_test_end(&numberOfPackets);
    }

    /* We want to execute packet sending as fast as possible:
     *  - Reschedule this EVENT_EXECUTE_DTM event
     *  - This will cause OSA_ProcessTasks to not return until there is no EVENT_EXECUTE_DTM event anymore
     *  - Full speed packet sending has to stop, once new HCI command is received
     *  - When new HCI command is received, BLEController_EmngrIsIdle will return false
     *  - When this happens, EVENT_STOP_DTM event will be sent which will clear the pending EVENT_EXECUTE_DTM
     *  - Once the EVENT_EXECUTE_DTM event is cleared, the full speed packet sending stops, and normal task execution
     * resumes
     */
    (void)OSA_EventSet((osa_event_handle_t)s_EventHandle, EVENT_EXECUTE_DTM);
    if (!BLEController_EmngrIsIdle())
    {
        BLEController_EmngrHandleAllEvents();
    }

    return status;
}

/* @brief Route XTAL oscillator output to CLKOUT on PIO0_9.
 * Connect either the 32.768kHz XTAL oscillator output, the 32MHz XTAL oscillator
 * or none to PIO0_9.
 * For the 32.768kHz XTAL oscillator, the clock out signal is recommended for frequency measurements.
 * For the 32MHz XTAL oscillator, the clock out signal can be used for frequency measurements,
 * but final measurements need to be done on the RF output using CW signals.
 * The signal on the CLKOUT pin is not suited for jitter measurements.
 */
static ble_stat_t SetClkOutFunction(uint8_t nbOfInParams,
                                    uint8_t *inParams,
                                    uint8_t *evntPcktP,
                                    uint8_t *outParamsLength,
                                    hci_return_command_type *returnCommandType)
{
    ble_stat_t status = SUCCESS;

    /* No parameters to return */
    *outParamsLength = 0;

    /* Extract the xtal parameter from the received pckt_p */
    uint8_t xtal = inParams[0];

    switch (xtal)
    {
        case 0:
            CLOCK_AttachClk(kNONE_to_SYS_CLKOUT);
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            break;
        case 1:
            CLOCK_AttachClk(kEXT_CLK_to_CLKOUT);
            CLOCK_SetClkDiv(kCLOCK_DivClkOut, 1, false);
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            break;
        case 2:
            CLOCK_AttachClk(kXTAL32K_to_OSC32K);
            CLOCK_AttachClk(kOSC32K_to_CLKOUT);
            CLOCK_SetClkDiv(kCLOCK_DivClkOut, 1, false);
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_COMPLETE;
            break;
        default:
            /* selected xtal oscillator output out of range */
            status = PARAMETER_OUT_OF_MANDATORY_RANGE;
            /* Return HCI_RETURN_COMMAND_TYPE_STATUS to mention that something went wrong */
            *returnCommandType = HCI_RETURN_COMMAND_TYPE_STATUS;
    }
    return status;
}

