nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/radiotestsuite_cmds.c
/*******************************************************************************
 * Public functions
 ******************************************************************************/

void SysTick_Handler(void)
{
    if (s_cwTestParams.active)
    {
        if (s_cwTestParams.currentOperateMs > 0) /* Total running time */
        {
            --s_cwTestParams.currentOperateMs;
        }
        else
        {
            (void)OSA_EventSet((osa_event_handle_t)s_EventHandle, EVENT_CW_PROCESS);
        }

        if (s_cwTestParams.currentDelayMs > 0) /* Delay per channel */
        {
            --s_cwTestParams.currentDelayMs;
        }
        else
        {
            (void)OSA_EventSet((osa_event_handle_t)s_EventHandle, EVENT_CW_PROCESS);
        }
    }
}

static void RadioTestSuiteTask(void *argument)
{
    osa_event_flags_t event = 0U;

    /* Wait for events */
    (void)OSA_EventWait((osa_event_handle_t)s_EventHandle, osaEventFlagsAll_c, (uint8_t)FALSE, osaWaitForever_c,
                        &event);

    if ((event & EVENT_CW_PROCESS) == EVENT_CW_PROCESS)
    {
        HandleStandaloneCwTest();
    }

    if ((event & EVENT_STOP_DTM) == EVENT_STOP_DTM)
    {
        (void)OSA_EventClear((osa_event_handle_t)s_EventHandle, EVENT_EXECUTE_DTM);
    }

    if ((event & EVENT_EXECUTE_DTM) == EVENT_EXECUTE_DTM)
    {
        ExecuteDTMTxAndCount();
    }
}

int RadioTestSuitePreMainInit(void)
{
    status_t status;
    flash_config_t flashInstance;
    int res;
    (void)res;
    (void)status;

    /* Retreive UUID */
    status = FLASH_Init(&flashInstance);
    assert_equal(kStatus_Success, status);
    status = FFR_GetUUID(&flashInstance, s_Uuid);
    assert_equal(kStatus_Success, status);

    /* Extend custom command array */
    res = HCICUSTOMCMD_Register(customHCIOperations_RadioTestSuite, sizeof(customHCIOperations_RadioTestSuite) /
                                                                        sizeof(customHCIOperations_RadioTestSuite[0]));
    assert(res == 0);

    return 0;
}
